# Задание-1: уравнение прямой вида y = kx + b задано в виде строки.
# Определить координату y точки с заданной координатой x.

equation = 'y = -12x + 11111140.2121'
x = 2.5
print("Уравнение - ", equation, "x = ", x)

# вычислите и выведите y

new = equation[4:]
a = new.find("x")
k = int(new[0:a])
b = float(new[(a+4):])


y = k*x + b
print("Координата у с заданной координатой x - ", y)
